In [1]:
# !.\myenv\Scripts\activate
import pandas as pd

In [3]:
# df = pd.read_csv('Family Income and Expenditure.csv')

In [4]:
# df.info()

In [5]:
# df.head()

In [6]:
# # Expense dataset
# import pandas as pd

# Loading first dataset

In [2]:
expense_dataset = pd.read_csv('./data/Personal_Finance_Dataset.csv')

In [3]:
expense_dataset.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1500 entries, 0 to 1499
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     1500 non-null   object
 1   Transaction Description  1500 non-null   object
 2   Category                 1500 non-null   object
 3   Amount                   1500 non-null   float64
 4   Type                     1500 non-null   object
dtypes: float64(1), object(4)
memory usage: 58.7+ KB

In [4]:
expense_dataset.head()

,Date,Transaction Description,Category,Amount,Type
0,2020-01-02,Score each.,Food & Drink,1485.69,Expense
1,2020-01-02,Quality throughout.,Utilities,1475.58,Expense
2,2020-01-04,Instead ahead despite measure ago.,Rent,1185.08,Expense
3,2020-01-05,Information last everything thank serve.,Investment,2291.00,Income
4,2020-01-13,Future choice whatever from.,Food & Drink,1126.88,Expense

In [5]:
expense_only = expense_dataset[expense_dataset['Type'] == 'Expense'][['Date','Transaction Description','Category', 'Amount']]
print(expense_only.tail())

            Date   Transaction Description          Category  Amount
1493  2024-12-21             Up hear draw.            Salary  784.35
1494  2024-12-23           Instead writer.  Health & Fitness  325.64
1495  2024-12-28            Quite as when.              Rent  514.09
1496  2024-12-28   Right analysis mention.     Entertainment  727.25
1498  2024-12-29  Discussion black follow.          Shopping  655.78

In [6]:
expense_only['Category'].unique()

array(['Food & Drink', 'Utilities', 'Rent', 'Shopping', 'Entertainment',
       'Health & Fitness', 'Salary', 'Travel'], dtype=object)

# Loading second dataset

In [7]:
expense_dataset_2 = pd.read_csv('./data/expenses_income_summary.csv')

In [8]:
expense_dataset_2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1155 entries, 0 to 1154
Data columns (total 15 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   Date               1155 non-null   object
 1   title              1131 non-null   object
 2   category           994 non-null    object
 3   account            1155 non-null   object
 4   amount             1155 non-null   object
 5   currency           1155 non-null   object
 6   type               1155 non-null   object
 7   transfer-amount    44 non-null     object
 8   transfer-currency  44 non-null     object
 9   to-account         44 non-null     object
 10  receive-amount     44 non-null     object
 11  receive-currency   44 non-null     object
 12  description        1 non-null      float64
 13  due-date           0 non-null      float64
 14  id                 1155 non-null   object
dtypes: float64(2), object(13)
memory usage: 135.5+ KB

In [9]:
expense_dataset_2.head()

,Date,title,category,account,amount,currency,type,transfer-amount,transfer-currency,to-account,receive-amount,receive-currency,description,due-date,id
0,2024-08-11 13:56:59.652,Karthik,Bills & Fees,Savings Bank,45.00,INR,EXPENSE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,74e78631-db14-4495-bfb9-85546b0bd2fe
1,2024-08-10 16:09:55.986,Juice,Food & Drinks,Cash,40.00,INR,EXPENSE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,65e12e62-9f63-4c6c-b452-6c7b42fbfb7f
2,2024-08-09 10:25:21.618,Tire,Transport,Cash,10.00,INR,EXPENSE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,9ecd93bd-a835-4263-86e2-99fea475fa37
3,2024-08-07 03:57:24.944,Baba,Bills & Fees,Savings Bank,200.00,INR,EXPENSE,NaN,NaN,NaN,NaN,NaN,NaN,NaN,00d39b2c-e722-485a-85ca-28f6506dc674
4,2024-08-04 13:09:08.452,Reward,Bills & Fees,Salary Bank,4.00,INR,INCOME,NaN,NaN,NaN,NaN,NaN,NaN,NaN,3861d205-3245-4926-ad69-4491b0bff547

In [10]:
expense_only_2 = expense_dataset_2[expense_dataset_2['type'] == 'EXPENSE'][['Date','title','category', 'amount']]
print(expense_only_2.tail())

                         Date   title      category    amount
1145  2023-04-22 15:12:02.162     NaN  Bills & Fees  1,109.00
1146  2023-04-22 15:11:40.053     NaN  Bills & Fees  1,398.00
1147  2023-04-22 12:05:08.538     NaN     Transport     20.00
1148  2023-04-22 10:39:20.483  Mobile  Bills & Fees    259.00
1149  2023-04-22 07:48:32.170  Stonks           NaN    130.00

# Combining Data

In [11]:
expense_only.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1222 entries, 0 to 1498
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     1222 non-null   object
 1   Transaction Description  1222 non-null   object
 2   Category                 1222 non-null   object
 3   Amount                   1222 non-null   float64
dtypes: float64(1), object(3)
memory usage: 47.7+ KB

In [12]:
expense_only_2.info()

<class 'pandas.core.frame.DataFrame'>
Index: 1008 entries, 0 to 1149
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Date      1008 non-null   object
 1   title     996 non-null    object
 2   category  930 non-null    object
 3   amount    1008 non-null   object
dtypes: object(4)
memory usage: 39.4+ KB

In [18]:
expense_only_2.rename(columns={'category': 'Category', 'amount': 'Amount', 'title':'Transaction Description'},inplace=True)
expense_only_2['Amount'] = pd.to_numeric(expense_only_2['Amount'], errors='coerce')

In [14]:
combined_df = pd.concat([expense_dataset, expense_only_2], ignore_index=True)

In [15]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2508 entries, 0 to 2507
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     2508 non-null   object
 1   Transaction Description  2496 non-null   object
 2   Category                 2430 non-null   object
 3   Amount                   2467 non-null   float64
 4   Type                     1500 non-null   object
dtypes: float64(1), object(4)
memory usage: 98.1+ KB

In [19]:
combined_df = combined_df[['Date','Transaction Description','Category','Amount']]

In [20]:
combined_df['Amount']

0       1485.69
1       1475.58
2       1185.08
3       2291.00
4       1126.88
         ...
2503        NaN
2504        NaN
2505      20.00
2506     259.00
2507     130.00
Name: Amount, Length: 2508, dtype: float64

In [21]:
combined_df.isna().sum()

Date                        0
Transaction Description    12
Category                   78
Amount                     41
dtype: int64

In [22]:
combined_df.Category.unique()

array(['Food & Drink', 'Utilities', 'Rent', 'Investment', 'Shopping',
       'Other', 'Entertainment', 'Health & Fitness', 'Salary', 'Travel',
       'Bills & Fees', 'Food & Drinks', 'Transport', nan], dtype=object)

In [23]:
combined_df['Category'].replace({'Food & Drink':'Food','Food & Drinks':'Food','Entertainment':'Other','Transport':'Travel',
                                 'Bills & Fees':'Utilities','Health & Fitness':'Health'},inplace=True)

C:\Users\HP\AppData\Local\Temp\ipykernel_11796\1952979828.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  combined_df['Category'].replace({'Food & Drink':'Food','Food & Drinks':'Food','Entertainment':'Other','Transport':'Travel',

In [24]:
combined_df.Category.unique()

array(['Food', 'Utilities', 'Rent', 'Investment', 'Shopping', 'Other',
       'Health', 'Salary', 'Travel', nan], dtype=object)

In [25]:
combined_df.dropna(inplace=True)
non_salary_condition = combined_df['Category'] != 'Salary'
combined_df = combined_df[non_salary_condition]

In [26]:
combined_df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 2240 entries, 0 to 2506
Data columns (total 4 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Date                     2240 non-null   object
 1   Transaction Description  2240 non-null   object
 2   Category                 2240 non-null   object
 3   Amount                   2240 non-null   float64
dtypes: float64(1), object(3)
memory usage: 87.5+ KB

In [27]:
dff = (combined_df['Category']=='Salary')

In [28]:
# Use the boolean mask (dff) to filter the original combined_df
salary_entries = combined_df[dff]

# Display the resulting DataFrame containing only 'Salary' rows
print(salary_entries)

Empty DataFrame
Columns: [Date, Transaction Description, Category, Amount]
Index: []

In [29]:
combined_df.isna().sum()

Date                       0
Transaction Description    0
Category                   0
Amount                     0
dtype: int64

In [30]:
combined_df.to_csv('./data/prepared_data/Combined_TS_data.csv')

# Now reading rest two datasets